[
    {
        "entry_id": 1,
        "day": 1,
        "time": "22:00",
        "event": "I boarded the train with Marcus. He still didn't mention anything about the diamonds.",
        "reaction": "He's too cautious. He stayed in car 7, I stayed in car 9."
    },
    {
        "entry_id": 2,
        "day": 1,
        "time": "22:15",
        "event": "I left my room to check Marcus’s room and see if it was easy to access.",
        "reaction": "I needed to scout the area before acting."
    },
    {
        "entry_id": 3,
        "day": 1,
        "time": "22:18",
        "event": "Outside Marcus’s room, I saw a woman arguing with him.",
        "reaction": "Turns out she was 'Uncle Li'—they were fighting over territory and trust."
    },
    {
        "entry_id": 4,
        "day": 1,
        "time": "22:20",
        "event": "The woman left. Marcus saw me and pulled me into his room, furious.",
        "reaction": "He scolded me for sneaking around. I kept quiet."
    },
    {
        "entry_id": 5,
        "day": 1,
        "time": "22:30",
        "event": "Marcus said he wanted to rest, so I left and went to the dining car.",
        "reaction": "I ate a little, then set an alarm for 23:30 and went to sleep."
    },
    {
        "entry_id": 6,
        "day": 1,
        "time": "23:40",
        "event": "I woke up late. My stomach hurt—maybe the food was bad.",
        "reaction": "The plan was delayed, but I still had to act."
    },
    {
        "entry_id": 7,
        "day": 1,
        "time": "23:43",
        "event": "I brought my sickle and went to the restroom first.",
        "reaction": "Needed to prepare myself and check the corridor."
    },
    {
        "entry_id": 8,
        "day": 1,
        "time": "23:50",
        "event": "I sneaked into Marcus’s room. He looked asleep, so I took the diamonds.",
        "reaction": "He didn’t move at all... I grabbed them and ran."
    },
    {
        "entry_id": 9,
        "day": 1,
        "time": "23:54",
        "event": "I left the room quickly.",
        "reaction": "My heart was racing—I had the diamonds."
    },
    {
        "entry_id": 10,
        "day": 1,
        "time": "23:55",
        "event": "I bumped into the attendant Ou and the woman Lin.",
        "reaction": "I clutched the diamonds tightly and rushed off."
    },
    {
        "entry_id": 11,
        "day": 1,
        "time": "00:00",
        "event": "Back in my room, I realized my phone was missing.",
        "reaction": "Did I forget it? Or did someone take it?"
    },
    {
        "entry_id": 12,
        "day": 1,
        "time": "00:10",
        "event": "I stole a random passenger’s phone and texted my brother to pick me up.",
        "reaction": "Just then, a loud bang hit and I was thrown into the wall."
    },
    {
        "entry_id": 13,
        "day": 1,
        "time": "00:15",
        "event": "The train stopped. A broadcast said we were stuck and couldn’t move.",
        "reaction": "Perfect timing or bad luck?"
    }
]